lkolbly/cmsis-svd/data/Cypress/MB9B560L.svd
        <!-- REGISTER "CCB" -->
        <register>
          <name>CCB</name>
          <description>CCB Register</description>
          <addressOffset>0x180</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CCB" -->
            <field>
              <name>CCB</name>
              <description>Oscillation boost current set bits</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BOOST" -->
        <register>
          <name>BOOST</name>
          <description>BOOST Register</description>
          <addressOffset>0x188</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BOOST" -->
            <field>
              <name>BOOST</name>
              <description>Oscillation boost time set bits</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EWKUP" -->
        <register>
          <name>EWKUP</name>
          <description>EWKUP Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUP0" -->
            <field>
              <name>WUP0</name>
              <description>Wakeup request bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VDET" -->
        <register>
          <name>VDET</name>
          <description>VDET Register</description>
          <addressOffset>0x190</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PON" -->
            <field>
              <name>PON</name>
              <description>Power-on bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HIBRST" -->
        <register>
          <name>HIBRST</name>
          <description>HIBRST Register</description>
          <addressOffset>0x198</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HIBRST" -->
            <field>
              <name>HIBRST</name>
              <description>Hibernation start bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPFR" -->
        <register>
          <name>VBPFR</name>
          <description>Port Function Set Register</description>
          <addressOffset>0x19C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SPSR" -->
            <field>
              <name>SPSR</name>
              <description>Oscillation pin function set bits</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR3" -->
            <field>
              <name>VPFR3</name>
              <description>Port function of P46/X0A pin set bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR2" -->
            <field>
              <name>VPFR2</name>
              <description>Port function of P47/X1A pin set bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR1" -->
            <field>
              <name>VPFR1</name>
              <description>Port function of P49/VWAKEUP pin set bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPFR0" -->
            <field>
              <name>VPFR0</name>
              <description>Port function of P48/VREGCTL pin set bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPCR" -->
        <register>
          <name>VBPCR</name>
          <description>Pull-up Set Register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VPCR3" -->
            <field>
              <name>VPCR3</name>
              <description>P46/X0A pin pull-up set bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR2" -->
            <field>
              <name>VPCR2</name>
              <description>P47/X1A pin pull-up set bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR1" -->
            <field>
              <name>VPCR1</name>
              <description>P49/VWAKEUP pin pull-up set bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPCR0" -->
            <field>
              <name>VPCR0</name>
              <description>P48/VREGCTL pin pull-up set bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDDR" -->
        <register>
          <name>VBDDR</name>
          <description>Port I/O Direction Set Register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDDR3" -->
            <field>
              <name>VDDR3</name>
              <description>Port direction of P46/X0A pin set bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR2" -->
            <field>
              <name>VDDR2</name>
              <description>Port direction of P47/X1A pin set bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR1" -->
            <field>
              <name>VDDR1</name>
              <description>Port direction of P49/VWAKEUP pin set bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDDR0" -->
            <field>
              <name>VDDR0</name>
              <description>Port direction of P48/VREGCTL pin set bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDIR" -->
        <register>
          <name>VBDIR</name>
          <description>Port Input Data Register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDIR3" -->
            <field>
              <name>VDIR3</name>
              <description>Port input data of P46/X0A pin bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR2" -->
            <field>
              <name>VDIR2</name>
              <description>Port input data of P47/X1A pin bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR1" -->
            <field>
              <name>VDIR1</name>
              <description>Port input data of P49/VWAKEUP pin bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDIR0" -->
            <field>
              <name>VDIR0</name>
              <description>Port input data of P48/VREGCTL pin bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBDOR" -->
        <register>
          <name>VBDOR</name>
          <description>Port Output Data Register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0F</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VDOR3" -->
            <field>
              <name>VDOR3</name>
              <description>Port output data of P46/X0A pin bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR2" -->
            <field>
              <name>VDOR2</name>
              <description>Port output data of P47/X1A pin bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR1" -->
            <field>
              <name>VDOR1</name>
              <description>Port output data of P49/VWAKEUP pin bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VDOR0" -->
            <field>
              <name>VDOR0</name>
              <description>Port output data of P48/VREGCTL pin bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VBPZR" -->
        <register>
          <name>VBPZR</name>
          <description>Port Pseudo-Open Drain Set Register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VPZR1" -->
            <field>
              <name>VPZR1</name>
              <description>P49/VWAKEUP pin pseudo-open drain set bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VPZR0" -->
            <field>
              <name>VPZR0</name>
              <description>P48/VREGCTL pin pseudo-open drain set bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BREG00" -->
        <register>
          <name>BREG00</name>
          <description>Backup Register</description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
