lkolbly/cmsis-svd/data/Cypress/MB9B560L.svd
        <!-- REGISTER "BREG16" -->
        <register>
          <name>BREG16</name>
          <description>Backup Register</description>
          <addressOffset>0x216</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG17" -->
        <register>
          <name>BREG17</name>
          <description>Backup Register</description>
          <addressOffset>0x217</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG18" -->
        <register>
          <name>BREG18</name>
          <description>Backup Register</description>
          <addressOffset>0x218</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG19" -->
        <register>
          <name>BREG19</name>
          <description>Backup Register</description>
          <addressOffset>0x219</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1A" -->
        <register>
          <name>BREG1A</name>
          <description>Backup Register</description>
          <addressOffset>0x21A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1B" -->
        <register>
          <name>BREG1B</name>
          <description>Backup Register</description>
          <addressOffset>0x21B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1C" -->
        <register>
          <name>BREG1C</name>
          <description>Backup Register</description>
          <addressOffset>0x21C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1D" -->
        <register>
          <name>BREG1D</name>
          <description>Backup Register</description>
          <addressOffset>0x21D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1E" -->
        <register>
          <name>BREG1E</name>
          <description>Backup Register</description>
          <addressOffset>0x21E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG1F" -->
        <register>
          <name>BREG1F</name>
          <description>Backup Register</description>
          <addressOffset>0x21F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG20" -->
        <register>
          <name>BREG20</name>
          <description>Backup Register</description>
          <addressOffset>0x220</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG21" -->
        <register>
          <name>BREG21</name>
          <description>Backup Register</description>
          <addressOffset>0x221</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG22" -->
        <register>
          <name>BREG22</name>
          <description>Backup Register</description>
          <addressOffset>0x222</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG23" -->
        <register>
          <name>BREG23</name>
          <description>Backup Register</description>
          <addressOffset>0x223</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG24" -->
        <register>
          <name>BREG24</name>
          <description>Backup Register</description>
          <addressOffset>0x224</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG25" -->
        <register>
          <name>BREG25</name>
          <description>Backup Register</description>
          <addressOffset>0x225</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG26" -->
        <register>
          <name>BREG26</name>
          <description>Backup Register</description>
          <addressOffset>0x226</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG27" -->
        <register>
          <name>BREG27</name>
          <description>Backup Register</description>
          <addressOffset>0x227</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG28" -->
        <register>
          <name>BREG28</name>
          <description>Backup Register</description>
          <addressOffset>0x228</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
